In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame([10, 20, 30, 40, 50])
df

    0
0  10
1  20
2  30
3  40
4  50

In [7]:
type(df), df.dtypes

(pandas.core.frame.DataFrame,
 0    int64
 dtype: object)

In [8]:
df = pd.DataFrame([[10, 20, 30, 40, 50],  [111, 222, 333, 444, 555]])
df

     0    1    2    3    4
0   10   20   30   40   50
1  111  222  333  444  555

In [9]:
df = pd.DataFrame({
          "temperaturi": [10, 20, 30, 40, 50],
          "decibeli": [111, 222, 333, 444, 555]
    })
df

   temperaturi  decibeli
0           10       111
1           20       222
2           30       333
3           40       444
4           50       555

In [10]:
df.dtypes

temperaturi    int64
decibeli       int64
dtype: object

In [11]:
df.describe()

       temperaturi   decibeli
count     5.000000    5.00000
mean     30.000000  333.00000
std      15.811388  175.50641
min      10.000000  111.00000
25%      20.000000  222.00000
50%      30.000000  333.00000
75%      40.000000  444.00000
max      50.000000  555.00000

In [12]:
df = pd.DataFrame({
          "temperaturi": [10, 20, 30, 40, 50],
          "decibeli": [111, 222, 333, 444, 555],
          "culori" : ["alb", "negru", None, None, None]
    })
df

   temperaturi  decibeli culori
0           10       111    alb
1           20       222  negru
2           30       333   None
3           40       444   None
4           50       555   None

In [13]:
df.to_csv("data_inventate.csv")

In [14]:
df_citit = pd.read_csv("data_inventate.csv")
df_citit

   Unnamed: 0  temperaturi  decibeli culori
0           0           10       111    alb
1           1           20       222  negru
2           2           30       333    NaN
3           3           40       444    NaN
4           4           50       555    NaN

In [15]:
df

   temperaturi  decibeli culori
0           10       111    alb
1           20       222  negru
2           30       333   None
3           40       444   None
4           50       555   None

In [19]:
valoarea_nan = df_citit["culori"][2]
valoarea_nan

nan

In [20]:
type(valoarea_nan)

float

In [22]:
df_citit_cu_index = pd.read_csv("data_inventate.csv", index_col=0)
df_citit_cu_index

   temperaturi  decibeli culori
0           10       111    alb
1           20       222  negru
2           30       333    NaN
3           40       444    NaN
4           50       555    NaN

In [23]:
df_citit_cu_index.to_json("date_inventat.json")